Qn 1 Convert the following list `my_lst` to a Pandas Series and set the explicit indices as 'one', 'two', 'three'. The data type of the elements should be `float64`.

In [1]:
import pandas as pd

my_lst = [1, 2, 3]

In [2]:
explicit_indices = ['one', 'two', 'three']
my_lst = pd.Series(my_lst, index = explicit_indices)
my_lst

one      1
two      2
three    3
dtype: int64

In [3]:
# pd.Series is a method provided by pandas to convert list to data series and /
#  by declaring index we can overwrite the default index with user choice

Qn 2

In [4]:
import numpy as np
np.random.seed(0)

arr2 = np.random.randint(1, 10, (5, 2))
arr2

array([[6, 1],
       [4, 4],
       [8, 4],
       [6, 3],
       [5, 8]])

Create a Pandas DataFrame exactly as shown below from the array `arr2`given in the cell above.

In [5]:
df = pd.DataFrame(arr2, index = ['zero', 'one', 'two', 'three', 'four'])
df.columns = ['col1', 'col2']
df

       col1  col2
zero      6     1
one       4     4
two       8     4
three     6     3
four      5     8

In [6]:
# Dataframe is a method to convert array to a dataframe, index and df.columns used for explicit indexing

Qn 3 Convert the data type of 'col1' in df from 'Question 2' to float.

In [7]:
df['col1']
df  #do not change
df['col1'] = df['col1'].astype(float)
df

       col1  col2
zero    6.0     1
one     4.0     4
two     8.0     4
three   6.0     3
four    5.0     8

In [8]:
# .astype is a method used to convert the data-type known as type conversion

Qn 4

In [9]:
dates = ['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20']
dates_series = pd.Series(dates)
dates_series

0         01 Jan 2015
1          10-02-2016
2            20180307
3          2014/05/06
4          2016-04-12
5    2019-04-06T11:20
dtype: object

Covert the `dates_series` given in the cell above to a time series. The result should be exactly as shown below.

In [10]:
timeseries = pd.to_datetime(dates, errors='coerce')
timeseries
pd.Series(timeseries)

0   2015-01-01
1          NaT
2          NaT
3          NaT
4          NaT
5          NaT
dtype: datetime64[ns]

In [11]:
# pd.to_datetime is a method in pandas that takes input datas and convert them to a standard form
# The errors='coerce' parameter is used to handle any invalid or unparseable dates by converting them to NaT (Not a Timestamp), making the operation more robust.

Qn 5

In [14]:
area = pd.Series({'California': 424,
                  'Texas': 696,
                  'New York': 141,
                  'Florida': 170,
                  'Illinois': 150
                  }) # values in thousand sq miles

population = pd.Series({'California': 38,
                  'Texas': 26,
                  'New York': 19,
                  'Florida': 20,
                  'Illinois': 129
                  }) # values in million

data = pd.DataFrame({'area': area, 'population': population}) 
data
#Given the above DataFrame `data`, multiply each value in 'area' column by 1000, and each value in 'population' by 1000000 (1 million).

            area  population
California   424          38
Texas        696          26
New York     141          19
Florida      170          20
Illinois     150         129

In [15]:
data['area'] = area * 1000
data['population'] = population * 1000000

data

              area  population
California  424000    38000000
Texas       696000    26000000
New York    141000    19000000
Florida     170000    20000000
Illinois    150000   129000000

In [16]:
# data['area'] is used to access every elements of column area and when area * 1000 each elements in area gets multiplied and similar case is of population

Create a third column `density` (population / area), which shows population density of each state in `data`.

In [17]:
data['density'] = data.population / data.area
data

              area  population     density
California  424000    38000000   89.622642
Texas       696000    26000000   37.356322
New York    141000    19000000  134.751773
Florida     170000    20000000  117.647059
Illinois    150000   129000000  860.000000

In [18]:
# data.population and data.area gets elements of the data frame

Sort `data` by `density` in descending order, and show top 3 states by population density.

In [19]:
data = data.sort_values(by='density', ascending=False)
data

              area  population     density
Illinois    150000   129000000  860.000000
New York    141000    19000000  134.751773
Florida     170000    20000000  117.647059
California  424000    38000000   89.622642
Texas       696000    26000000   37.356322

In [20]:
#   .sort_values is used to sort the data , by is used to define what will be the base on which the data will be sorted
#   ascending = False is used to sort data in descending order

Using the dataframe `data`, show only the states that have the population density between 100 and 200. Show only 2 columns - 'population' and 'density'.

In [21]:
filtered_data  = data[(data['density'] >= 100) & (data['density'] <= 200)]

filtered_data

            area  population     density
New York  141000    19000000  134.751773
Florida   170000    20000000  117.647059

In [22]:
#  here we used condition where density is equals or greater to 100  and smaller or equal to 200
# we used & (AND) to include both cases

Qn 6

In [25]:
import numpy as np
import pandas as pd
np.random.seed(0)
df = pd.DataFrame(np.random.randint(0, 5, (5, 4)), columns=list('ABCD'))
df
#Given the above DataFrame `df`, multiply each column by column 'A'.

   A  B  C  D
0  4  0  3  3
1  3  1  3  2
2  4  0  0  4
3  2  1  0  1
4  1  0  1  4

In [26]:
df = df.mul(df['A'], axis=0)
df

    A  B   C   D
0  16  0  12  12
1   9  3   9   6
2  16  0   0  16
3   4  2   0   2
4   1  0   1   4

In [27]:
# df.mul is pandas method where each element is multiplied by given number
# df['A'] access the elemnts of and axis = 0 takes columns

Qn 7

In [28]:
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv

population = pd.read_csv('state-population.csv')
population[:10]

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 57935  100 57935    0     0  63416      0 --:--:-- --:--:-- --:--:-- 64016

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
5           AL    total  2011   4801627.0
6           AL    total  2009   4757938.0
7           AL  under18  2009   1134192.0
8           AL  under18  2013   1111481.0
9           AL    total  2013   4833722.0

In [30]:
#Given the above dataframe `population`, select only the rows with 'total' (excluding 'under18') in the 'ages' column.

In [31]:
total_population = population[population['ages'] == 'total']
total_population[:5]

  state/region   ages  year  population
1           AL  total  2012   4817528.0
3           AL  total  2010   4785570.0
5           AL  total  2011   4801627.0
6           AL  total  2009   4757938.0
9           AL  total  2013   4833722.0

Follow the following steps.

1. Group the `total_population` dataframe by 'state/region', 
2. select just the 'population' column, and
3. find the mean of 'population' in each group.
4. Convert the data type of the values in the result to `int` data type.
5. Sort the values in descending order
6. Show only the first 10 values.

You will need to perform all the above steps in one line of code. 

The format will be like: `total_population`.[step1].[step2].[step3].[step4].[step5].[step6]

In [32]:
population_mean_by_state = total_population.groupby('state/region')['population'].mean().astype(int).sort_values(ascending=False).head(10)
population_mean_by_state

state/region
USA    284997946
CA      34334137
TX      21606262
NY      18925805
FL      16496542
IL      12370796
PA      12369597
OH      11342378
MI       9826635
NJ       8420691
Name: population, dtype: int32

In [33]:
# groupby['state/region'] ['population'] is used to groupby state 
# .mean() is used to find the mean of the group elemnts
# .astype() is used for type conversion
# ascending=false used to sort in descending order
# head(10) displays 10 top/first datas

Qn 8

In [37]:
# Please change path to your file as appropriate
import pandas as pd
msft = pd.read_csv('MSFT_stock_for_Pandas_HW_Q8.csv')

msft.set_index('Date', inplace=True)
msft.index = pd.to_datetime(msft.index)
msft.tail()

#Using the `msft` data above, create a Pandas Series exactly as shown below with the values as the 'High' prices at the ends of business years.

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2021-06-28,266.190002,268.899994,265.910004,268.720001,268.720001,19590000
2021-06-29,268.869995,271.649994,267.980011,271.399994,271.399994,19937800
2021-06-30,270.690002,271.359985,269.600006,270.899994,270.899994,21656500
2021-07-01,269.609985,271.839996,269.600006,271.600006,271.600006,16725300
2021-07-02,272.820007,278.000000,272.500000,277.649994,277.649994,26458000

In [38]:
high_annual = msft['High'].resample('BY').max()
high_annual

C:\Users\hp\AppData\Local\Temp\ipykernel_6924\2342118182.py:1: FutureWarning: 'BY' is deprecated and will be removed in a future version, please use 'BYE' instead.
  high_annual = msft['High'].resample('BY').max()

Date
2000-12-29     58.562500
2001-12-31     38.075001
2002-12-31     35.310001
2003-12-31     30.000000
2004-12-31     30.200001
2005-12-30     28.250000
2006-12-29     30.260000
2007-12-31     37.500000
2008-12-31     35.959999
2009-12-31     31.500000
2010-12-31     31.580000
2011-12-30     29.459999
2012-12-31     32.950001
2013-12-31     38.980000
2014-12-31     50.049999
2015-12-31     56.849998
2016-12-30     64.099998
2017-12-29     87.500000
2018-12-31    116.180000
2019-12-31    159.550003
2020-12-31    232.860001
2021-12-31    278.000000
Freq: BYE-DEC, Name: High, dtype: float64

In [39]:
#Using the `msft` data, create a Pandas Series exactly as shown below with the values as the *mean of the 'High' prices of each year* reported at business year ends.

In [40]:
high_annual_means = None
high_annual_means